Revit 2024 API
EnergyAnalysisMaterial.Thickness Property
 The thickness of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double Thickness { get; }
Visual Basic
Public ReadOnly Property Thickness As Double
	Get
Visual C++
public:
property double Thickness {
	double get ();
}
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace